bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_usb.c
// int usb_write(struct device *dev, uint32_t pos, const void *buffer, uint32_t size)
// {

// }

// int usb_read(struct device *dev, uint32_t pos, void *buffer, uint32_t size)
// {

// }

/**
 * @brief configure and enable endpoint
 * This function sets endpoint configuration according to one specified in USB
 * endpoint descriptor and then enables it for data transfers.
 *
 * @param dev
 * @param ep_cfg  ep_cfg Endpoint 
 * @return int
 */
int usb_dc_ep_open(struct device *dev, const struct usb_dc_ep_cfg *ep_cfg)
{
    uint8_t ep;
    EP_Config_Type epCfg;

    if (!ep_cfg)
    {
        return -1;
    }
    ep = ep_cfg->ep_addr;

    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    USB_DC_LOG_DBG("%s ep %x, mps %d, type %d\r\n", __func__, ep, ep_cfg->ep_mps, ep_cfg->ep_type);

    if (USB_EP_DIR_IS_OUT(ep))
    {
        epCfg.dir = EP_OUT;
        epCfg.EPMaxPacketSize = ep_cfg->ep_mps;
        usb_fs_device.out_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_fs_device.out_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
    }
    else
    {
        epCfg.dir = EP_IN;
        epCfg.EPMaxPacketSize = ep_cfg->ep_mps;
        usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_fs_device.in_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
    }

    if (ep_idx)
    {
        switch (ep_cfg->ep_type)
        {
            case USBD_EP_TYPE_CTRL:
                epCfg.type = USB_DC_EP_TYPE_CTRL;
                break;
            case USBD_EP_TYPE_ISOC:
                epCfg.type = USB_DC_EP_TYPE_ISOC;
                break;
            case USBD_EP_TYPE_BULK:
                epCfg.type = USB_DC_EP_TYPE_BULK;
                break;
            case USBD_EP_TYPE_INTR:
                epCfg.type = USB_DC_EP_TYPE_INTR;
                break;
            default:
                return -1;
        }
        USB_Set_EPx_Config(ep_idx, &epCfg);
        if (USB_EP_DIR_IS_OUT(ep))
        {
            /* Clear NAK and enable ep */
            USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
            usb_fs_device.out_ep[ep_idx].ep_ena = 1U;
        }
        else
        {
            //USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
            USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_NACK);
            usb_fs_device.in_ep[ep_idx].ep_ena = 1U;
        }
    }
    else
    {
        if (USB_EP_DIR_IS_OUT(ep))
        {
            usb_fs_device.out_ep[ep_idx].ep_ena = 1U;
        }
        else
        {
            usb_fs_device.in_ep[ep_idx].ep_ena = 1U;
        }
    }

    return 0;
}

/**
 * @brief Check if the selected endpoint is stalled
 *
 * @param[in]  ep       Endpoint address corresponding to the one
 *                      listed in the device configuration table
 * @param[out] stalled  Endpoint stall status
 *
 * @return 0 on success, negative errno code on fail.
 */

/**
 * @brief
 *
 * @param dev
 * @param ep
 * @param stalled
 * @return int
 */
int usb_dc_ep_is_stalled(struct device *dev, const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!stalled)
    {
        return -1;
    }

    *stalled = 0U;
    if (USB_EP_DIR_IS_OUT(ep))
    {
        if (USB_Get_EPx_Status(ep_idx) & USB_EP_STATUS_STALL && usb_fs_device.out_ep[ep_idx].is_stalled)
            *stalled = 1U;
    }
    else
    {
        if (USB_Get_EPx_Status(ep_idx) & USB_EP_STATUS_STALL && usb_fs_device.in_ep[ep_idx].is_stalled)
            *stalled = 1U;
    }

    return 0;
}
/**
 * @brief Write data to the specified endpoint
 *
 * This function is called to write data to the specified endpoint. The
 * supplied usbd_endpoint_callback function will be called when data is transmitted
 * out.
 *
 * @param[in]  ep        Endpoint address corresponding to the one
 *                       listed in the device configuration table
 * @param[in]  data      Pointer to data to write
 * @param[in]  data_len  Length of the data requested to write. This may
 *                       be zero for a zero length status packet.
 * @param[out] ret_bytes Bytes scheduled for transmission. This value
 *                       may be NULL if the application expects all
 *                       bytes to be written
 *
 * @return 0 on success, negative errno code on fail.
 */

/**
 * @brief
 *
 * @param dev
 * @param ep
 * @param data
 * @param data_len
 * @param ret_bytes
 * @return int
 */
int usb_dc_ep_write(struct device *dev, const uint8_t ep, const uint8_t *data, uint32_t data_len, uint32_t *ret_bytes)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    uint32_t timeout = 0x00FFFFFF;
    uint32_t ep_tx_fifo_addr;

    /* Check if IN ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_IN)
    {
        return -1;
    }

    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep))
    {
        return -2;
    }

    while (!USB_Is_EPx_RDY_Free(ep_idx))
    {
        timeout--;
        if (!timeout)
        {
            USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
            return -3;
        }
    }

    // key = irq_lock();
    if (!data)
    {
        if (!data_len)
        {
            /* Zero length packet */
            /* Clear NAK and enable ep */
            USB_Set_EPx_Status(USB_EP_GET_IDX(ep), USB_EP_STATUS_ACK);
            return 0;
        }
        else
        {
            USB_DC_LOG_ERR("data is null\r\n");
            return -4;
        }
    }

    if (data_len > usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps)
    {
        /* Check if transfer len is too big */
        data_len = usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps;
    }

    /* Wait for FIFO space available */
    do
    {
        uint32_t avail_space = USB_Get_EPx_TX_FIFO_CNT(ep_idx);
        if (avail_space == usb_fs_device.in_ep[ep_idx].ep_cfg.ep_mps)
        {
            break;
        }
        /* Make sure we don't hog the CPU */
        // k_yield();
        //USB_DC_LOG_ERR("EP%d have remain data\r\n", ep_idx);
    }
    while (1);

